import React, { useState, useEffect } from 'react';
import { useParams, useNavigate } from 'react-router-dom';
import { Container, Button, Row, Col } from 'reactstrap';
import HotelDetails from '../components/HotelDetails';

const hotels = [
  {
    id: 1,
    name: 'Отель "Солнечный"',
    location: 'Минск, ул. Ленина, 123',
    price_per_night: 150,
    rating: 4.5,
    description: 'Уютный отель в центре города с видом на парк. Идеальное место для семейного отдыха. Гости могут насладиться прогулками по живописным аллеям, посетить местные достопримечательности и отведать блюда национальной кухни в ресторане отеля.'
  },
  {
    id: 2,
    name: 'Отель "Уютный"',
    location: 'Брест, ул. Советская, 456',
    price_per_night: 120,
    rating: 4.2,
    description: 'Небольшой отель в тихом районе города. Здесь вы найдете спокойную и расслабляющую атмосферу, идеальную для отдыха от городской суеты. Гости могут насладиться прогулками по живописным паркам, посетить местные музеи и галереи, а также отдохнуть в уютном лаунж-баре отеля.'
  },
  {
    id: 3,
    name: 'Отель "Комфорт"',
    location: 'Гродно, ул. Советская, 789',
    price_per_night: 180,
    rating: 4.8,
    description: 'Современный отель с высоким уровнем сервиса. Здесь вы найдете все необходимое для комфортного и роскошного отдыха. Гости могут воспользоваться услугами спа-центра, посетить фитнес-зал, а также отведать блюда изысканной кухни в ресторане отеля.'
  },
  {
    id: 4,
    name: 'Отель "Уют"',
    location: 'Витебск, ул. Ленина, 321',
    price_per_night: 100,
    rating: 4.0,
    description: 'Небольшой семейный отель с домашней атмосферой. Здесь вы сможете отдохнуть от городской суеты и насладиться спокойствием. Гости могут прогуляться по живописным улочкам города, посетить местные достопримечательности и отведать блюда домашней кухни в ресторане отеля.'
  },
  {
    id: 5,
    name: 'Отель "Престиж"',
    location: 'Могилев, ул. Советская, 654',
    price_per_night: 220,
    rating: 4.9,
    description: 'Роскошный отель с высоким уровнем сервиса. Здесь вы найдете все для незабываемого отдыха: элегантные номера, высококлассный ресторан, спа-центр и фитнес-зал. Гости могут насладиться панорамным видом на город и воспользоваться услугами персонального консьержа.'
  },
  {
    id: 6,
    name: 'Отель "Уютный Дом"',
    location: 'Гомель, ул. Ленина, 987',
    price_per_night: 130,
    rating: 4.3,
    description: 'Небольшой отель с домашней атмосферой. Здесь вы сможете отдохнуть от городской суеты и насладиться спокойствием. Гости могут прогуляться по живописным паркам, посетить местные музеи и галереи, а также отведать блюда домашней кухни в ресторане отеля.'
  },
  {
    id: 7,
    name: 'Отель "Релакс"',
    location: 'Брест, ул. Советская, 321',
    price_per_night: 190,
    rating: 4.6,
    description: 'Отель с SPA-центром и бассейном. Идеальное место для расслабляющего отдыха. Гости могут насладиться процедурами в SPA, поплавать в бассейне, а также посетить ресторан, где подают блюда из свежих местных продуктов.'
  },
  {
    id: 8,
    name: 'Отель "Горный Приют"',
    location: 'Браслав, ул. Озерная, 456',
    price_per_night: 160,
    rating: 4.7,
    description: 'Уютный отель в живописном горном районе. Идеальное место для любителей активного отдыха и ценителей природы. Гости могут совершать пешие прогулки, заниматься велоспортом, а также посетить местные достопримечательности и отведать блюда национальной кухни.'
  },
  {
    id: 9,
    name: 'Отель "Лазурный Берег"',
    location: 'Пинск, ул. Набережная, 789',
    price_per_night: 200,
    rating: 4.8,
    description: 'Роскошный отель на берегу живописного озера. Идеальное место для романтического отдыха или семейного отпуска. Гости могут насладиться прогулками по набережной, поплавать в озере, а также посетить SPA-центр и ресторан с видом на воду.'
  },
  {
    id: 10,
    name: 'Отель "Горная Сказка"',
    location: 'Нарочь, ул. Лесная, 159',
    price_per_night: 180,
    rating: 4.6,
    description: 'Отель в живописном горном районе. Идеальное место для любителей активного отдыха и ценителей природы. Гости могут заниматься различными видами спорта, совершать пешие прогулки, а также посетить местные достопримечательности и отведать блюда национальной кухни.'
  }
];

const HotelDetailsPage = () => {
  const { id } = useParams();
  const [hotel, setHotel] = useState(null);
  const navigate = useNavigate();

  useEffect(() => {
    const foundHotel = hotels.find((h) => h.id === parseInt(id));
    if (foundHotel) {
      setHotel(foundHotel);
    } else {
      navigate('/');
    }
  }, [id, navigate]);

  return (
    <Container>
      {hotel ? (
        <>
          <Row className="justify-content-center">
            <Col md={8}>
              <HotelDetails hotel={hotel} />
            </Col>
          </Row>
          <Row className="justify-content-center">
            <Col md={8}>
              <Button color="primary" onClick={() => navigate('/booking')}>
                Забронировать
              </Button>
            </Col>
          </Row>
        </>
      ) : (
        <p>Загрузка...</p>
      )}
    </Container>
  );
};

export default HotelDetailsPage;